grevaillot/svd_tools/headers/ATSAM4SP32A/piob.h
#pragma once 

/* --- PIOB: Parallel Input/Output Controller B --------------------- */

/** @defgroup piob_registers Parallel Input/Output Controller B Register
@{*/

/** PIOB_PER PIO Enable Register **/
#define PIOB_PER			MMIO32(PIOB_BASE + 0x00)
/** PIOB_PDR PIO Disable Register **/
#define PIOB_PDR			MMIO32(PIOB_BASE + 0x04)
/** PIOB_PSR PIO Status Register **/
#define PIOB_PSR			MMIO32(PIOB_BASE + 0x08)
/** PIOB_OER Output Enable Register **/
#define PIOB_OER			MMIO32(PIOB_BASE + 0x10)
/** PIOB_ODR Output Disable Register **/
#define PIOB_ODR			MMIO32(PIOB_BASE + 0x14)
/** PIOB_OSR Output Status Register **/
#define PIOB_OSR			MMIO32(PIOB_BASE + 0x18)
/** PIOB_IFER Glitch Input Filter Enable Register **/
#define PIOB_IFER			MMIO32(PIOB_BASE + 0x20)
/** PIOB_IFDR Glitch Input Filter Disable Register **/
#define PIOB_IFDR			MMIO32(PIOB_BASE + 0x24)
/** PIOB_IFSR Glitch Input Filter Status Register **/
#define PIOB_IFSR			MMIO32(PIOB_BASE + 0x28)
/** PIOB_SODR Set Output Data Register **/
#define PIOB_SODR			MMIO32(PIOB_BASE + 0x30)
/** PIOB_CODR Clear Output Data Register **/
#define PIOB_CODR			MMIO32(PIOB_BASE + 0x34)
/** PIOB_ODSR Output Data Status Register **/
#define PIOB_ODSR			MMIO32(PIOB_BASE + 0x38)
/** PIOB_PDSR Pin Data Status Register **/
#define PIOB_PDSR			MMIO32(PIOB_BASE + 0x3c)
/** PIOB_IER Interrupt Enable Register **/
#define PIOB_IER			MMIO32(PIOB_BASE + 0x40)
/** PIOB_IDR Interrupt Disable Register **/
#define PIOB_IDR			MMIO32(PIOB_BASE + 0x44)
/** PIOB_IMR Interrupt Mask Register **/
#define PIOB_IMR			MMIO32(PIOB_BASE + 0x48)
/** PIOB_ISR Interrupt Status Register **/
#define PIOB_ISR			MMIO32(PIOB_BASE + 0x4c)
/** PIOB_MDER Multi-driver Enable Register **/
#define PIOB_MDER			MMIO32(PIOB_BASE + 0x50)
/** PIOB_MDDR Multi-driver Disable Register **/
#define PIOB_MDDR			MMIO32(PIOB_BASE + 0x54)
/** PIOB_MDSR Multi-driver Status Register **/
#define PIOB_MDSR			MMIO32(PIOB_BASE + 0x58)
/** PIOB_PUDR Pull-up Disable Register **/
#define PIOB_PUDR			MMIO32(PIOB_BASE + 0x60)
/** PIOB_PUER Pull-up Enable Register **/
#define PIOB_PUER			MMIO32(PIOB_BASE + 0x64)
/** PIOB_PUSR Pad Pull-up Status Register **/
#define PIOB_PUSR			MMIO32(PIOB_BASE + 0x68)
/** PIOB_ABCDSR[0] Peripheral Select Register **/
#define PIOB_ABCDSR[0]			MMIO32(PIOB_BASE + 0x70)
/** PIOB_ABCDSR[1] Peripheral Select Register **/
#define PIOB_ABCDSR[1]			MMIO32(PIOB_BASE + 0x74)
/** PIOB_IFSCDR Input Filter Slow Clock Disable Register **/
#define PIOB_IFSCDR			MMIO32(PIOB_BASE + 0x80)
/** PIOB_IFSCER Input Filter Slow Clock Enable Register **/
#define PIOB_IFSCER			MMIO32(PIOB_BASE + 0x84)
/** PIOB_IFSCSR Input Filter Slow Clock Status Register **/
#define PIOB_IFSCSR			MMIO32(PIOB_BASE + 0x88)
/** PIOB_SCDR Slow Clock Divider Debouncing Register **/
#define PIOB_SCDR			MMIO32(PIOB_BASE + 0x8c)
/** PIOB_PPDDR Pad Pull-down Disable Register **/
#define PIOB_PPDDR			MMIO32(PIOB_BASE + 0x90)
/** PIOB_PPDER Pad Pull-down Enable Register **/
#define PIOB_PPDER			MMIO32(PIOB_BASE + 0x94)
/** PIOB_PPDSR Pad Pull-down Status Register **/
#define PIOB_PPDSR			MMIO32(PIOB_BASE + 0x98)
/** PIOB_OWER Output Write Enable **/
#define PIOB_OWER			MMIO32(PIOB_BASE + 0xa0)
/** PIOB_OWDR Output Write Disable **/
#define PIOB_OWDR			MMIO32(PIOB_BASE + 0xa4)
/** PIOB_OWSR Output Write Status Register **/
#define PIOB_OWSR			MMIO32(PIOB_BASE + 0xa8)
/** PIOB_AIMER Additional Interrupt Modes Enable Register **/
#define PIOB_AIMER			MMIO32(PIOB_BASE + 0xb0)
/** PIOB_AIMDR Additional Interrupt Modes Disables Register **/
#define PIOB_AIMDR			MMIO32(PIOB_BASE + 0xb4)
/** PIOB_AIMMR Additional Interrupt Modes Mask Register **/
#define PIOB_AIMMR			MMIO32(PIOB_BASE + 0xb8)
/** PIOB_ESR Edge Select Register **/
#define PIOB_ESR			MMIO32(PIOB_BASE + 0xc0)
/** PIOB_LSR Level Select Register **/
#define PIOB_LSR			MMIO32(PIOB_BASE + 0xc4)
/** PIOB_ELSR Edge/Level Status Register **/
#define PIOB_ELSR			MMIO32(PIOB_BASE + 0xc8)
/** PIOB_FELLSR Falling Edge/Low Level Select Register **/
#define PIOB_FELLSR			MMIO32(PIOB_BASE + 0xd0)
/** PIOB_REHLSR Rising Edge/ High Level Select Register **/
#define PIOB_REHLSR			MMIO32(PIOB_BASE + 0xd4)
/** PIOB_FRLHSR Fall/Rise - Low/High Status Register **/
#define PIOB_FRLHSR			MMIO32(PIOB_BASE + 0xd8)
/** PIOB_LOCKSR Lock Status **/
#define PIOB_LOCKSR			MMIO32(PIOB_BASE + 0xe0)
/** PIOB_WPMR Write Protect Mode Register **/
#define PIOB_WPMR			MMIO32(PIOB_BASE + 0xe4)
/** PIOB_WPSR Write Protect Status Register **/
#define PIOB_WPSR			MMIO32(PIOB_BASE + 0xe8)
/** PIOB_SCHMITT Schmitt Trigger Register **/
#define PIOB_SCHMITT			MMIO32(PIOB_BASE + 0x100)
/** PIOB_PCMR Parallel Capture Mode Register **/
#define PIOB_PCMR			MMIO32(PIOB_BASE + 0x150)
/** PIOB_PCIER Parallel Capture Interrupt Enable Register **/
#define PIOB_PCIER			MMIO32(PIOB_BASE + 0x154)
/** PIOB_PCIDR Parallel Capture Interrupt Disable Register **/
#define PIOB_PCIDR			MMIO32(PIOB_BASE + 0x158)
/** PIOB_PCIMR Parallel Capture Interrupt Mask Register **/
#define PIOB_PCIMR			MMIO32(PIOB_BASE + 0x15c)
/** PIOB_PCISR Parallel Capture Interrupt Status Register **/
#define PIOB_PCISR			MMIO32(PIOB_BASE + 0x160)
/** PIOB_PCRHR Parallel Capture Reception Holding Register **/
#define PIOB_PCRHR			MMIO32(PIOB_BASE + 0x164)

/**@}*/


/** @defgroup piob_per PER PIO Enable Register
@{*/

/** PIOB_PER_P31 PIO Enable **/
#define PIOB_PER_P31		(1 << 31)
/** PIOB_PER_P30 PIO Enable **/
#define PIOB_PER_P30		(1 << 30)
/** PIOB_PER_P29 PIO Enable **/
#define PIOB_PER_P29		(1 << 29)
/** PIOB_PER_P28 PIO Enable **/
#define PIOB_PER_P28		(1 << 28)
/** PIOB_PER_P27 PIO Enable **/
#define PIOB_PER_P27		(1 << 27)
/** PIOB_PER_P26 PIO Enable **/
#define PIOB_PER_P26		(1 << 26)
/** PIOB_PER_P25 PIO Enable **/
#define PIOB_PER_P25		(1 << 25)
/** PIOB_PER_P24 PIO Enable **/
#define PIOB_PER_P24		(1 << 24)
/** PIOB_PER_P23 PIO Enable **/
#define PIOB_PER_P23		(1 << 23)
/** PIOB_PER_P22 PIO Enable **/
#define PIOB_PER_P22		(1 << 22)
/** PIOB_PER_P21 PIO Enable **/
#define PIOB_PER_P21		(1 << 21)
/** PIOB_PER_P20 PIO Enable **/
#define PIOB_PER_P20		(1 << 20)
/** PIOB_PER_P19 PIO Enable **/
#define PIOB_PER_P19		(1 << 19)
/** PIOB_PER_P18 PIO Enable **/
#define PIOB_PER_P18		(1 << 18)
/** PIOB_PER_P17 PIO Enable **/
#define PIOB_PER_P17		(1 << 17)
/** PIOB_PER_P16 PIO Enable **/
#define PIOB_PER_P16		(1 << 16)
/** PIOB_PER_P15 PIO Enable **/
#define PIOB_PER_P15		(1 << 15)
/** PIOB_PER_P14 PIO Enable **/
#define PIOB_PER_P14		(1 << 14)
/** PIOB_PER_P13 PIO Enable **/
#define PIOB_PER_P13		(1 << 13)
/** PIOB_PER_P12 PIO Enable **/
#define PIOB_PER_P12		(1 << 12)
/** PIOB_PER_P11 PIO Enable **/
#define PIOB_PER_P11		(1 << 11)
/** PIOB_PER_P10 PIO Enable **/
#define PIOB_PER_P10		(1 << 10)
/** PIOB_PER_P9 PIO Enable **/
#define PIOB_PER_P9		(1 << 9)
/** PIOB_PER_P8 PIO Enable **/
#define PIOB_PER_P8		(1 << 8)
/** PIOB_PER_P7 PIO Enable **/
#define PIOB_PER_P7		(1 << 7)
/** PIOB_PER_P6 PIO Enable **/
#define PIOB_PER_P6		(1 << 6)
/** PIOB_PER_P5 PIO Enable **/
#define PIOB_PER_P5		(1 << 5)
/** PIOB_PER_P4 PIO Enable **/
#define PIOB_PER_P4		(1 << 4)
/** PIOB_PER_P3 PIO Enable **/
#define PIOB_PER_P3		(1 << 3)
/** PIOB_PER_P2 PIO Enable **/
#define PIOB_PER_P2		(1 << 2)
/** PIOB_PER_P1 PIO Enable **/
#define PIOB_PER_P1		(1 << 1)
/** PIOB_PER_P0 PIO Enable **/
#define PIOB_PER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pdr PDR PIO Disable Register
@{*/

/** PIOB_PDR_P31 PIO Disable **/
#define PIOB_PDR_P31		(1 << 31)
/** PIOB_PDR_P30 PIO Disable **/
#define PIOB_PDR_P30		(1 << 30)
/** PIOB_PDR_P29 PIO Disable **/
#define PIOB_PDR_P29		(1 << 29)
/** PIOB_PDR_P28 PIO Disable **/
#define PIOB_PDR_P28		(1 << 28)
/** PIOB_PDR_P27 PIO Disable **/
#define PIOB_PDR_P27		(1 << 27)
/** PIOB_PDR_P26 PIO Disable **/
#define PIOB_PDR_P26		(1 << 26)
/** PIOB_PDR_P25 PIO Disable **/
#define PIOB_PDR_P25		(1 << 25)
/** PIOB_PDR_P24 PIO Disable **/
#define PIOB_PDR_P24		(1 << 24)
/** PIOB_PDR_P23 PIO Disable **/
#define PIOB_PDR_P23		(1 << 23)
/** PIOB_PDR_P22 PIO Disable **/
#define PIOB_PDR_P22		(1 << 22)
/** PIOB_PDR_P21 PIO Disable **/
#define PIOB_PDR_P21		(1 << 21)
/** PIOB_PDR_P20 PIO Disable **/
#define PIOB_PDR_P20		(1 << 20)
/** PIOB_PDR_P19 PIO Disable **/
#define PIOB_PDR_P19		(1 << 19)
/** PIOB_PDR_P18 PIO Disable **/
#define PIOB_PDR_P18		(1 << 18)
/** PIOB_PDR_P17 PIO Disable **/
#define PIOB_PDR_P17		(1 << 17)
/** PIOB_PDR_P16 PIO Disable **/
#define PIOB_PDR_P16		(1 << 16)
/** PIOB_PDR_P15 PIO Disable **/
#define PIOB_PDR_P15		(1 << 15)
/** PIOB_PDR_P14 PIO Disable **/
#define PIOB_PDR_P14		(1 << 14)
/** PIOB_PDR_P13 PIO Disable **/
#define PIOB_PDR_P13		(1 << 13)
/** PIOB_PDR_P12 PIO Disable **/
#define PIOB_PDR_P12		(1 << 12)
/** PIOB_PDR_P11 PIO Disable **/
#define PIOB_PDR_P11		(1 << 11)
/** PIOB_PDR_P10 PIO Disable **/
#define PIOB_PDR_P10		(1 << 10)
/** PIOB_PDR_P9 PIO Disable **/
#define PIOB_PDR_P9		(1 << 9)
/** PIOB_PDR_P8 PIO Disable **/
#define PIOB_PDR_P8		(1 << 8)
/** PIOB_PDR_P7 PIO Disable **/
#define PIOB_PDR_P7		(1 << 7)
/** PIOB_PDR_P6 PIO Disable **/
#define PIOB_PDR_P6		(1 << 6)
/** PIOB_PDR_P5 PIO Disable **/
#define PIOB_PDR_P5		(1 << 5)
/** PIOB_PDR_P4 PIO Disable **/
#define PIOB_PDR_P4		(1 << 4)
/** PIOB_PDR_P3 PIO Disable **/
#define PIOB_PDR_P3		(1 << 3)
/** PIOB_PDR_P2 PIO Disable **/
#define PIOB_PDR_P2		(1 << 2)
/** PIOB_PDR_P1 PIO Disable **/
#define PIOB_PDR_P1		(1 << 1)
/** PIOB_PDR_P0 PIO Disable **/
#define PIOB_PDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_psr PSR PIO Status Register
@{*/

/** PIOB_PSR_P31 PIO Status **/
#define PIOB_PSR_P31		(1 << 31)
/** PIOB_PSR_P30 PIO Status **/
#define PIOB_PSR_P30		(1 << 30)
/** PIOB_PSR_P29 PIO Status **/
#define PIOB_PSR_P29		(1 << 29)
/** PIOB_PSR_P28 PIO Status **/
#define PIOB_PSR_P28		(1 << 28)
/** PIOB_PSR_P27 PIO Status **/
#define PIOB_PSR_P27		(1 << 27)
/** PIOB_PSR_P26 PIO Status **/
#define PIOB_PSR_P26		(1 << 26)
/** PIOB_PSR_P25 PIO Status **/
#define PIOB_PSR_P25		(1 << 25)
/** PIOB_PSR_P24 PIO Status **/
#define PIOB_PSR_P24		(1 << 24)
/** PIOB_PSR_P23 PIO Status **/
#define PIOB_PSR_P23		(1 << 23)
/** PIOB_PSR_P22 PIO Status **/
#define PIOB_PSR_P22		(1 << 22)
/** PIOB_PSR_P21 PIO Status **/
#define PIOB_PSR_P21		(1 << 21)
/** PIOB_PSR_P20 PIO Status **/
#define PIOB_PSR_P20		(1 << 20)
/** PIOB_PSR_P19 PIO Status **/
#define PIOB_PSR_P19		(1 << 19)
/** PIOB_PSR_P18 PIO Status **/
#define PIOB_PSR_P18		(1 << 18)
/** PIOB_PSR_P17 PIO Status **/
#define PIOB_PSR_P17		(1 << 17)
/** PIOB_PSR_P16 PIO Status **/
#define PIOB_PSR_P16		(1 << 16)
/** PIOB_PSR_P15 PIO Status **/
#define PIOB_PSR_P15		(1 << 15)
/** PIOB_PSR_P14 PIO Status **/
#define PIOB_PSR_P14		(1 << 14)
/** PIOB_PSR_P13 PIO Status **/
#define PIOB_PSR_P13		(1 << 13)
/** PIOB_PSR_P12 PIO Status **/
#define PIOB_PSR_P12		(1 << 12)
/** PIOB_PSR_P11 PIO Status **/
#define PIOB_PSR_P11		(1 << 11)
/** PIOB_PSR_P10 PIO Status **/
#define PIOB_PSR_P10		(1 << 10)
/** PIOB_PSR_P9 PIO Status **/
#define PIOB_PSR_P9		(1 << 9)
/** PIOB_PSR_P8 PIO Status **/
#define PIOB_PSR_P8		(1 << 8)
/** PIOB_PSR_P7 PIO Status **/
#define PIOB_PSR_P7		(1 << 7)
/** PIOB_PSR_P6 PIO Status **/
#define PIOB_PSR_P6		(1 << 6)
/** PIOB_PSR_P5 PIO Status **/
#define PIOB_PSR_P5		(1 << 5)
/** PIOB_PSR_P4 PIO Status **/
#define PIOB_PSR_P4		(1 << 4)
/** PIOB_PSR_P3 PIO Status **/
#define PIOB_PSR_P3		(1 << 3)
/** PIOB_PSR_P2 PIO Status **/
#define PIOB_PSR_P2		(1 << 2)
/** PIOB_PSR_P1 PIO Status **/
#define PIOB_PSR_P1		(1 << 1)
/** PIOB_PSR_P0 PIO Status **/
#define PIOB_PSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_oer OER Output Enable Register
@{*/

/** PIOB_OER_P31 Output Enable **/
#define PIOB_OER_P31		(1 << 31)
/** PIOB_OER_P30 Output Enable **/
#define PIOB_OER_P30		(1 << 30)
/** PIOB_OER_P29 Output Enable **/
#define PIOB_OER_P29		(1 << 29)
/** PIOB_OER_P28 Output Enable **/
#define PIOB_OER_P28		(1 << 28)
/** PIOB_OER_P27 Output Enable **/
#define PIOB_OER_P27		(1 << 27)
/** PIOB_OER_P26 Output Enable **/
#define PIOB_OER_P26		(1 << 26)
/** PIOB_OER_P25 Output Enable **/
#define PIOB_OER_P25		(1 << 25)
/** PIOB_OER_P24 Output Enable **/
#define PIOB_OER_P24		(1 << 24)
/** PIOB_OER_P23 Output Enable **/
#define PIOB_OER_P23		(1 << 23)
/** PIOB_OER_P22 Output Enable **/
#define PIOB_OER_P22		(1 << 22)
/** PIOB_OER_P21 Output Enable **/
#define PIOB_OER_P21		(1 << 21)
/** PIOB_OER_P20 Output Enable **/
#define PIOB_OER_P20		(1 << 20)
/** PIOB_OER_P19 Output Enable **/
#define PIOB_OER_P19		(1 << 19)
/** PIOB_OER_P18 Output Enable **/
#define PIOB_OER_P18		(1 << 18)
/** PIOB_OER_P17 Output Enable **/
#define PIOB_OER_P17		(1 << 17)
/** PIOB_OER_P16 Output Enable **/
#define PIOB_OER_P16		(1 << 16)
/** PIOB_OER_P15 Output Enable **/
#define PIOB_OER_P15		(1 << 15)
/** PIOB_OER_P14 Output Enable **/
#define PIOB_OER_P14		(1 << 14)
/** PIOB_OER_P13 Output Enable **/
#define PIOB_OER_P13		(1 << 13)
/** PIOB_OER_P12 Output Enable **/
#define PIOB_OER_P12		(1 << 12)
/** PIOB_OER_P11 Output Enable **/
#define PIOB_OER_P11		(1 << 11)
/** PIOB_OER_P10 Output Enable **/
#define PIOB_OER_P10		(1 << 10)
/** PIOB_OER_P9 Output Enable **/
#define PIOB_OER_P9		(1 << 9)
/** PIOB_OER_P8 Output Enable **/
#define PIOB_OER_P8		(1 << 8)
/** PIOB_OER_P7 Output Enable **/
#define PIOB_OER_P7		(1 << 7)
/** PIOB_OER_P6 Output Enable **/
#define PIOB_OER_P6		(1 << 6)
/** PIOB_OER_P5 Output Enable **/
#define PIOB_OER_P5		(1 << 5)
/** PIOB_OER_P4 Output Enable **/
#define PIOB_OER_P4		(1 << 4)
/** PIOB_OER_P3 Output Enable **/
#define PIOB_OER_P3		(1 << 3)
/** PIOB_OER_P2 Output Enable **/
#define PIOB_OER_P2		(1 << 2)
/** PIOB_OER_P1 Output Enable **/
#define PIOB_OER_P1		(1 << 1)
/** PIOB_OER_P0 Output Enable **/
#define PIOB_OER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_odr ODR Output Disable Register
@{*/

/** PIOB_ODR_P31 Output Disable **/
#define PIOB_ODR_P31		(1 << 31)
/** PIOB_ODR_P30 Output Disable **/
#define PIOB_ODR_P30		(1 << 30)
/** PIOB_ODR_P29 Output Disable **/
#define PIOB_ODR_P29		(1 << 29)
/** PIOB_ODR_P28 Output Disable **/
#define PIOB_ODR_P28		(1 << 28)
/** PIOB_ODR_P27 Output Disable **/
#define PIOB_ODR_P27		(1 << 27)
/** PIOB_ODR_P26 Output Disable **/
#define PIOB_ODR_P26		(1 << 26)
/** PIOB_ODR_P25 Output Disable **/
#define PIOB_ODR_P25		(1 << 25)
/** PIOB_ODR_P24 Output Disable **/
#define PIOB_ODR_P24		(1 << 24)
/** PIOB_ODR_P23 Output Disable **/
#define PIOB_ODR_P23		(1 << 23)
/** PIOB_ODR_P22 Output Disable **/
#define PIOB_ODR_P22		(1 << 22)
/** PIOB_ODR_P21 Output Disable **/
#define PIOB_ODR_P21		(1 << 21)
/** PIOB_ODR_P20 Output Disable **/
#define PIOB_ODR_P20		(1 << 20)
/** PIOB_ODR_P19 Output Disable **/
#define PIOB_ODR_P19		(1 << 19)
/** PIOB_ODR_P18 Output Disable **/
#define PIOB_ODR_P18		(1 << 18)
/** PIOB_ODR_P17 Output Disable **/
#define PIOB_ODR_P17		(1 << 17)
/** PIOB_ODR_P16 Output Disable **/
#define PIOB_ODR_P16		(1 << 16)
/** PIOB_ODR_P15 Output Disable **/
#define PIOB_ODR_P15		(1 << 15)
/** PIOB_ODR_P14 Output Disable **/
#define PIOB_ODR_P14		(1 << 14)
/** PIOB_ODR_P13 Output Disable **/
#define PIOB_ODR_P13		(1 << 13)
/** PIOB_ODR_P12 Output Disable **/
#define PIOB_ODR_P12		(1 << 12)
/** PIOB_ODR_P11 Output Disable **/
#define PIOB_ODR_P11		(1 << 11)
/** PIOB_ODR_P10 Output Disable **/
#define PIOB_ODR_P10		(1 << 10)
/** PIOB_ODR_P9 Output Disable **/
#define PIOB_ODR_P9		(1 << 9)
/** PIOB_ODR_P8 Output Disable **/
#define PIOB_ODR_P8		(1 << 8)
/** PIOB_ODR_P7 Output Disable **/
#define PIOB_ODR_P7		(1 << 7)
/** PIOB_ODR_P6 Output Disable **/
#define PIOB_ODR_P6		(1 << 6)
/** PIOB_ODR_P5 Output Disable **/
#define PIOB_ODR_P5		(1 << 5)
/** PIOB_ODR_P4 Output Disable **/
#define PIOB_ODR_P4		(1 << 4)
/** PIOB_ODR_P3 Output Disable **/
#define PIOB_ODR_P3		(1 << 3)
/** PIOB_ODR_P2 Output Disable **/
#define PIOB_ODR_P2		(1 << 2)
/** PIOB_ODR_P1 Output Disable **/
#define PIOB_ODR_P1		(1 << 1)
/** PIOB_ODR_P0 Output Disable **/
#define PIOB_ODR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_osr OSR Output Status Register
@{*/

/** PIOB_OSR_P31 Output Status **/
#define PIOB_OSR_P31		(1 << 31)
/** PIOB_OSR_P30 Output Status **/
#define PIOB_OSR_P30		(1 << 30)
/** PIOB_OSR_P29 Output Status **/
#define PIOB_OSR_P29		(1 << 29)
/** PIOB_OSR_P28 Output Status **/
#define PIOB_OSR_P28		(1 << 28)
/** PIOB_OSR_P27 Output Status **/
#define PIOB_OSR_P27		(1 << 27)
/** PIOB_OSR_P26 Output Status **/
#define PIOB_OSR_P26		(1 << 26)
/** PIOB_OSR_P25 Output Status **/
#define PIOB_OSR_P25		(1 << 25)
/** PIOB_OSR_P24 Output Status **/
#define PIOB_OSR_P24		(1 << 24)
/** PIOB_OSR_P23 Output Status **/
#define PIOB_OSR_P23		(1 << 23)
/** PIOB_OSR_P22 Output Status **/
#define PIOB_OSR_P22		(1 << 22)
/** PIOB_OSR_P21 Output Status **/
#define PIOB_OSR_P21		(1 << 21)
/** PIOB_OSR_P20 Output Status **/
#define PIOB_OSR_P20		(1 << 20)
/** PIOB_OSR_P19 Output Status **/
#define PIOB_OSR_P19		(1 << 19)
/** PIOB_OSR_P18 Output Status **/
#define PIOB_OSR_P18		(1 << 18)
/** PIOB_OSR_P17 Output Status **/
#define PIOB_OSR_P17		(1 << 17)
/** PIOB_OSR_P16 Output Status **/
#define PIOB_OSR_P16		(1 << 16)
/** PIOB_OSR_P15 Output Status **/
#define PIOB_OSR_P15		(1 << 15)
/** PIOB_OSR_P14 Output Status **/
#define PIOB_OSR_P14		(1 << 14)
/** PIOB_OSR_P13 Output Status **/
#define PIOB_OSR_P13		(1 << 13)
/** PIOB_OSR_P12 Output Status **/
#define PIOB_OSR_P12		(1 << 12)
/** PIOB_OSR_P11 Output Status **/
#define PIOB_OSR_P11		(1 << 11)
/** PIOB_OSR_P10 Output Status **/
#define PIOB_OSR_P10		(1 << 10)
/** PIOB_OSR_P9 Output Status **/
#define PIOB_OSR_P9		(1 << 9)
/** PIOB_OSR_P8 Output Status **/
#define PIOB_OSR_P8		(1 << 8)
/** PIOB_OSR_P7 Output Status **/
#define PIOB_OSR_P7		(1 << 7)
/** PIOB_OSR_P6 Output Status **/
#define PIOB_OSR_P6		(1 << 6)
/** PIOB_OSR_P5 Output Status **/
#define PIOB_OSR_P5		(1 << 5)
/** PIOB_OSR_P4 Output Status **/
#define PIOB_OSR_P4		(1 << 4)
/** PIOB_OSR_P3 Output Status **/
#define PIOB_OSR_P3		(1 << 3)
/** PIOB_OSR_P2 Output Status **/
#define PIOB_OSR_P2		(1 << 2)
/** PIOB_OSR_P1 Output Status **/
#define PIOB_OSR_P1		(1 << 1)
/** PIOB_OSR_P0 Output Status **/
#define PIOB_OSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifer IFER Glitch Input Filter Enable Register
@{*/

/** PIOB_IFER_P31 Input Filter Enable **/
#define PIOB_IFER_P31		(1 << 31)
/** PIOB_IFER_P30 Input Filter Enable **/
#define PIOB_IFER_P30		(1 << 30)
/** PIOB_IFER_P29 Input Filter Enable **/
#define PIOB_IFER_P29		(1 << 29)
/** PIOB_IFER_P28 Input Filter Enable **/
#define PIOB_IFER_P28		(1 << 28)
/** PIOB_IFER_P27 Input Filter Enable **/
#define PIOB_IFER_P27		(1 << 27)
/** PIOB_IFER_P26 Input Filter Enable **/
#define PIOB_IFER_P26		(1 << 26)
/** PIOB_IFER_P25 Input Filter Enable **/
#define PIOB_IFER_P25		(1 << 25)
/** PIOB_IFER_P24 Input Filter Enable **/
#define PIOB_IFER_P24		(1 << 24)
/** PIOB_IFER_P23 Input Filter Enable **/
#define PIOB_IFER_P23		(1 << 23)
/** PIOB_IFER_P22 Input Filter Enable **/
#define PIOB_IFER_P22		(1 << 22)
/** PIOB_IFER_P21 Input Filter Enable **/
#define PIOB_IFER_P21		(1 << 21)
/** PIOB_IFER_P20 Input Filter Enable **/
#define PIOB_IFER_P20		(1 << 20)
/** PIOB_IFER_P19 Input Filter Enable **/
#define PIOB_IFER_P19		(1 << 19)
/** PIOB_IFER_P18 Input Filter Enable **/
#define PIOB_IFER_P18		(1 << 18)
/** PIOB_IFER_P17 Input Filter Enable **/
#define PIOB_IFER_P17		(1 << 17)
/** PIOB_IFER_P16 Input Filter Enable **/
#define PIOB_IFER_P16		(1 << 16)
/** PIOB_IFER_P15 Input Filter Enable **/
#define PIOB_IFER_P15		(1 << 15)
/** PIOB_IFER_P14 Input Filter Enable **/
#define PIOB_IFER_P14		(1 << 14)
/** PIOB_IFER_P13 Input Filter Enable **/
#define PIOB_IFER_P13		(1 << 13)
/** PIOB_IFER_P12 Input Filter Enable **/
#define PIOB_IFER_P12		(1 << 12)
/** PIOB_IFER_P11 Input Filter Enable **/
#define PIOB_IFER_P11		(1 << 11)
/** PIOB_IFER_P10 Input Filter Enable **/
#define PIOB_IFER_P10		(1 << 10)
/** PIOB_IFER_P9 Input Filter Enable **/
#define PIOB_IFER_P9		(1 << 9)
/** PIOB_IFER_P8 Input Filter Enable **/
#define PIOB_IFER_P8		(1 << 8)
/** PIOB_IFER_P7 Input Filter Enable **/
#define PIOB_IFER_P7		(1 << 7)
/** PIOB_IFER_P6 Input Filter Enable **/
#define PIOB_IFER_P6		(1 << 6)
/** PIOB_IFER_P5 Input Filter Enable **/
#define PIOB_IFER_P5		(1 << 5)
/** PIOB_IFER_P4 Input Filter Enable **/
#define PIOB_IFER_P4		(1 << 4)
/** PIOB_IFER_P3 Input Filter Enable **/
#define PIOB_IFER_P3		(1 << 3)
/** PIOB_IFER_P2 Input Filter Enable **/
#define PIOB_IFER_P2		(1 << 2)
/** PIOB_IFER_P1 Input Filter Enable **/
#define PIOB_IFER_P1		(1 << 1)
/** PIOB_IFER_P0 Input Filter Enable **/
#define PIOB_IFER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifdr IFDR Glitch Input Filter Disable Register
@{*/

/** PIOB_IFDR_P31 Input Filter Disable **/
#define PIOB_IFDR_P31		(1 << 31)
/** PIOB_IFDR_P30 Input Filter Disable **/
#define PIOB_IFDR_P30		(1 << 30)
/** PIOB_IFDR_P29 Input Filter Disable **/
#define PIOB_IFDR_P29		(1 << 29)
/** PIOB_IFDR_P28 Input Filter Disable **/
#define PIOB_IFDR_P28		(1 << 28)
/** PIOB_IFDR_P27 Input Filter Disable **/
#define PIOB_IFDR_P27		(1 << 27)
/** PIOB_IFDR_P26 Input Filter Disable **/
#define PIOB_IFDR_P26		(1 << 26)
/** PIOB_IFDR_P25 Input Filter Disable **/
#define PIOB_IFDR_P25		(1 << 25)
/** PIOB_IFDR_P24 Input Filter Disable **/
#define PIOB_IFDR_P24		(1 << 24)
/** PIOB_IFDR_P23 Input Filter Disable **/
#define PIOB_IFDR_P23		(1 << 23)
/** PIOB_IFDR_P22 Input Filter Disable **/
#define PIOB_IFDR_P22		(1 << 22)
/** PIOB_IFDR_P21 Input Filter Disable **/
#define PIOB_IFDR_P21		(1 << 21)
/** PIOB_IFDR_P20 Input Filter Disable **/
#define PIOB_IFDR_P20		(1 << 20)
/** PIOB_IFDR_P19 Input Filter Disable **/
#define PIOB_IFDR_P19		(1 << 19)
/** PIOB_IFDR_P18 Input Filter Disable **/
#define PIOB_IFDR_P18		(1 << 18)
/** PIOB_IFDR_P17 Input Filter Disable **/
#define PIOB_IFDR_P17		(1 << 17)
/** PIOB_IFDR_P16 Input Filter Disable **/
#define PIOB_IFDR_P16		(1 << 16)
/** PIOB_IFDR_P15 Input Filter Disable **/
#define PIOB_IFDR_P15		(1 << 15)
/** PIOB_IFDR_P14 Input Filter Disable **/
#define PIOB_IFDR_P14		(1 << 14)
/** PIOB_IFDR_P13 Input Filter Disable **/
#define PIOB_IFDR_P13		(1 << 13)
/** PIOB_IFDR_P12 Input Filter Disable **/
#define PIOB_IFDR_P12		(1 << 12)
/** PIOB_IFDR_P11 Input Filter Disable **/
#define PIOB_IFDR_P11		(1 << 11)
/** PIOB_IFDR_P10 Input Filter Disable **/
#define PIOB_IFDR_P10		(1 << 10)
/** PIOB_IFDR_P9 Input Filter Disable **/
#define PIOB_IFDR_P9		(1 << 9)
/** PIOB_IFDR_P8 Input Filter Disable **/
#define PIOB_IFDR_P8		(1 << 8)
/** PIOB_IFDR_P7 Input Filter Disable **/
#define PIOB_IFDR_P7		(1 << 7)
/** PIOB_IFDR_P6 Input Filter Disable **/
#define PIOB_IFDR_P6		(1 << 6)
/** PIOB_IFDR_P5 Input Filter Disable **/
#define PIOB_IFDR_P5		(1 << 5)
/** PIOB_IFDR_P4 Input Filter Disable **/
#define PIOB_IFDR_P4		(1 << 4)
/** PIOB_IFDR_P3 Input Filter Disable **/
#define PIOB_IFDR_P3		(1 << 3)
/** PIOB_IFDR_P2 Input Filter Disable **/
#define PIOB_IFDR_P2		(1 << 2)
/** PIOB_IFDR_P1 Input Filter Disable **/
#define PIOB_IFDR_P1		(1 << 1)
/** PIOB_IFDR_P0 Input Filter Disable **/
#define PIOB_IFDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifsr IFSR Glitch Input Filter Status Register
@{*/

