grevaillot/svd_tools/headers/ATSAM4SP32A/piob.h
/** PIOB_ABCDSR[0]_P31 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P31		(1 << 31)
/** PIOB_ABCDSR[0]_P30 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P30		(1 << 30)
/** PIOB_ABCDSR[0]_P29 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P29		(1 << 29)
/** PIOB_ABCDSR[0]_P28 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P28		(1 << 28)
/** PIOB_ABCDSR[0]_P27 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P27		(1 << 27)
/** PIOB_ABCDSR[0]_P26 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P26		(1 << 26)
/** PIOB_ABCDSR[0]_P25 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P25		(1 << 25)
/** PIOB_ABCDSR[0]_P24 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P24		(1 << 24)
/** PIOB_ABCDSR[0]_P23 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P23		(1 << 23)
/** PIOB_ABCDSR[0]_P22 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P22		(1 << 22)
/** PIOB_ABCDSR[0]_P21 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P21		(1 << 21)
/** PIOB_ABCDSR[0]_P20 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P20		(1 << 20)
/** PIOB_ABCDSR[0]_P19 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P19		(1 << 19)
/** PIOB_ABCDSR[0]_P18 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P18		(1 << 18)
/** PIOB_ABCDSR[0]_P17 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P17		(1 << 17)
/** PIOB_ABCDSR[0]_P16 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P16		(1 << 16)
/** PIOB_ABCDSR[0]_P15 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P15		(1 << 15)
/** PIOB_ABCDSR[0]_P14 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P14		(1 << 14)
/** PIOB_ABCDSR[0]_P13 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P13		(1 << 13)
/** PIOB_ABCDSR[0]_P12 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P12		(1 << 12)
/** PIOB_ABCDSR[0]_P11 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P11		(1 << 11)
/** PIOB_ABCDSR[0]_P10 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P10		(1 << 10)
/** PIOB_ABCDSR[0]_P9 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P9		(1 << 9)
/** PIOB_ABCDSR[0]_P8 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P8		(1 << 8)
/** PIOB_ABCDSR[0]_P7 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P7		(1 << 7)
/** PIOB_ABCDSR[0]_P6 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P6		(1 << 6)
/** PIOB_ABCDSR[0]_P5 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P5		(1 << 5)
/** PIOB_ABCDSR[0]_P4 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P4		(1 << 4)
/** PIOB_ABCDSR[0]_P3 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P3		(1 << 3)
/** PIOB_ABCDSR[0]_P2 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P2		(1 << 2)
/** PIOB_ABCDSR[0]_P1 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P1		(1 << 1)
/** PIOB_ABCDSR[0]_P0 Peripheral Select. **/
#define PIOB_ABCDSR[0]_P0		(1 << 0)

/**@}*/

/** @defgroup piob_abcdsr[1] ABCDSR[1] Peripheral Select Register
@{*/

/** PIOB_ABCDSR[1]_P31 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P31		(1 << 31)
/** PIOB_ABCDSR[1]_P30 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P30		(1 << 30)
/** PIOB_ABCDSR[1]_P29 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P29		(1 << 29)
/** PIOB_ABCDSR[1]_P28 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P28		(1 << 28)
/** PIOB_ABCDSR[1]_P27 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P27		(1 << 27)
/** PIOB_ABCDSR[1]_P26 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P26		(1 << 26)
/** PIOB_ABCDSR[1]_P25 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P25		(1 << 25)
/** PIOB_ABCDSR[1]_P24 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P24		(1 << 24)
/** PIOB_ABCDSR[1]_P23 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P23		(1 << 23)
/** PIOB_ABCDSR[1]_P22 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P22		(1 << 22)
/** PIOB_ABCDSR[1]_P21 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P21		(1 << 21)
/** PIOB_ABCDSR[1]_P20 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P20		(1 << 20)
/** PIOB_ABCDSR[1]_P19 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P19		(1 << 19)
/** PIOB_ABCDSR[1]_P18 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P18		(1 << 18)
/** PIOB_ABCDSR[1]_P17 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P17		(1 << 17)
/** PIOB_ABCDSR[1]_P16 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P16		(1 << 16)
/** PIOB_ABCDSR[1]_P15 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P15		(1 << 15)
/** PIOB_ABCDSR[1]_P14 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P14		(1 << 14)
/** PIOB_ABCDSR[1]_P13 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P13		(1 << 13)
/** PIOB_ABCDSR[1]_P12 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P12		(1 << 12)
/** PIOB_ABCDSR[1]_P11 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P11		(1 << 11)
/** PIOB_ABCDSR[1]_P10 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P10		(1 << 10)
/** PIOB_ABCDSR[1]_P9 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P9		(1 << 9)
/** PIOB_ABCDSR[1]_P8 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P8		(1 << 8)
/** PIOB_ABCDSR[1]_P7 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P7		(1 << 7)
/** PIOB_ABCDSR[1]_P6 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P6		(1 << 6)
/** PIOB_ABCDSR[1]_P5 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P5		(1 << 5)
/** PIOB_ABCDSR[1]_P4 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P4		(1 << 4)
/** PIOB_ABCDSR[1]_P3 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P3		(1 << 3)
/** PIOB_ABCDSR[1]_P2 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P2		(1 << 2)
/** PIOB_ABCDSR[1]_P1 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P1		(1 << 1)
/** PIOB_ABCDSR[1]_P0 Peripheral Select. **/
#define PIOB_ABCDSR[1]_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifscdr IFSCDR Input Filter Slow Clock Disable Register
@{*/

/** PIOB_IFSCDR_P31 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P31		(1 << 31)
/** PIOB_IFSCDR_P30 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P30		(1 << 30)
/** PIOB_IFSCDR_P29 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P29		(1 << 29)
/** PIOB_IFSCDR_P28 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P28		(1 << 28)
/** PIOB_IFSCDR_P27 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P27		(1 << 27)
/** PIOB_IFSCDR_P26 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P26		(1 << 26)
/** PIOB_IFSCDR_P25 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P25		(1 << 25)
/** PIOB_IFSCDR_P24 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P24		(1 << 24)
/** PIOB_IFSCDR_P23 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P23		(1 << 23)
/** PIOB_IFSCDR_P22 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P22		(1 << 22)
/** PIOB_IFSCDR_P21 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P21		(1 << 21)
/** PIOB_IFSCDR_P20 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P20		(1 << 20)
/** PIOB_IFSCDR_P19 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P19		(1 << 19)
/** PIOB_IFSCDR_P18 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P18		(1 << 18)
/** PIOB_IFSCDR_P17 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P17		(1 << 17)
/** PIOB_IFSCDR_P16 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P16		(1 << 16)
/** PIOB_IFSCDR_P15 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P15		(1 << 15)
/** PIOB_IFSCDR_P14 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P14		(1 << 14)
/** PIOB_IFSCDR_P13 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P13		(1 << 13)
/** PIOB_IFSCDR_P12 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P12		(1 << 12)
/** PIOB_IFSCDR_P11 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P11		(1 << 11)
/** PIOB_IFSCDR_P10 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P10		(1 << 10)
/** PIOB_IFSCDR_P9 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P9		(1 << 9)
/** PIOB_IFSCDR_P8 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P8		(1 << 8)
/** PIOB_IFSCDR_P7 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P7		(1 << 7)
/** PIOB_IFSCDR_P6 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P6		(1 << 6)
/** PIOB_IFSCDR_P5 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P5		(1 << 5)
/** PIOB_IFSCDR_P4 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P4		(1 << 4)
/** PIOB_IFSCDR_P3 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P3		(1 << 3)
/** PIOB_IFSCDR_P2 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P2		(1 << 2)
/** PIOB_IFSCDR_P1 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P1		(1 << 1)
/** PIOB_IFSCDR_P0 PIO Clock Glitch Filtering Select. **/
#define PIOB_IFSCDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifscer IFSCER Input Filter Slow Clock Enable Register
@{*/

