grevaillot/svd_tools/headers/ATSAM4SP32A/piob.h
/** PIOB_IFSCER_P31 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P31		(1 << 31)
/** PIOB_IFSCER_P30 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P30		(1 << 30)
/** PIOB_IFSCER_P29 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P29		(1 << 29)
/** PIOB_IFSCER_P28 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P28		(1 << 28)
/** PIOB_IFSCER_P27 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P27		(1 << 27)
/** PIOB_IFSCER_P26 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P26		(1 << 26)
/** PIOB_IFSCER_P25 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P25		(1 << 25)
/** PIOB_IFSCER_P24 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P24		(1 << 24)
/** PIOB_IFSCER_P23 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P23		(1 << 23)
/** PIOB_IFSCER_P22 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P22		(1 << 22)
/** PIOB_IFSCER_P21 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P21		(1 << 21)
/** PIOB_IFSCER_P20 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P20		(1 << 20)
/** PIOB_IFSCER_P19 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P19		(1 << 19)
/** PIOB_IFSCER_P18 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P18		(1 << 18)
/** PIOB_IFSCER_P17 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P17		(1 << 17)
/** PIOB_IFSCER_P16 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P16		(1 << 16)
/** PIOB_IFSCER_P15 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P15		(1 << 15)
/** PIOB_IFSCER_P14 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P14		(1 << 14)
/** PIOB_IFSCER_P13 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P13		(1 << 13)
/** PIOB_IFSCER_P12 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P12		(1 << 12)
/** PIOB_IFSCER_P11 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P11		(1 << 11)
/** PIOB_IFSCER_P10 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P10		(1 << 10)
/** PIOB_IFSCER_P9 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P9		(1 << 9)
/** PIOB_IFSCER_P8 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P8		(1 << 8)
/** PIOB_IFSCER_P7 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P7		(1 << 7)
/** PIOB_IFSCER_P6 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P6		(1 << 6)
/** PIOB_IFSCER_P5 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P5		(1 << 5)
/** PIOB_IFSCER_P4 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P4		(1 << 4)
/** PIOB_IFSCER_P3 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P3		(1 << 3)
/** PIOB_IFSCER_P2 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P2		(1 << 2)
/** PIOB_IFSCER_P1 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P1		(1 << 1)
/** PIOB_IFSCER_P0 Debouncing Filtering Select. **/
#define PIOB_IFSCER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifscsr IFSCSR Input Filter Slow Clock Status Register
@{*/

/** PIOB_IFSCSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P31		(1 << 31)
/** PIOB_IFSCSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P30		(1 << 30)
/** PIOB_IFSCSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P29		(1 << 29)
/** PIOB_IFSCSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P28		(1 << 28)
/** PIOB_IFSCSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P27		(1 << 27)
/** PIOB_IFSCSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P26		(1 << 26)
/** PIOB_IFSCSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P25		(1 << 25)
/** PIOB_IFSCSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P24		(1 << 24)
/** PIOB_IFSCSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P23		(1 << 23)
/** PIOB_IFSCSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P22		(1 << 22)
/** PIOB_IFSCSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P21		(1 << 21)
/** PIOB_IFSCSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P20		(1 << 20)
/** PIOB_IFSCSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P19		(1 << 19)
/** PIOB_IFSCSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P18		(1 << 18)
/** PIOB_IFSCSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P17		(1 << 17)
/** PIOB_IFSCSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P16		(1 << 16)
/** PIOB_IFSCSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P15		(1 << 15)
/** PIOB_IFSCSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P14		(1 << 14)
/** PIOB_IFSCSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P13		(1 << 13)
/** PIOB_IFSCSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P12		(1 << 12)
/** PIOB_IFSCSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P11		(1 << 11)
/** PIOB_IFSCSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P10		(1 << 10)
/** PIOB_IFSCSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P9		(1 << 9)
/** PIOB_IFSCSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P8		(1 << 8)
/** PIOB_IFSCSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P7		(1 << 7)
/** PIOB_IFSCSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P6		(1 << 6)
/** PIOB_IFSCSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P5		(1 << 5)
/** PIOB_IFSCSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P4		(1 << 4)
/** PIOB_IFSCSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P3		(1 << 3)
/** PIOB_IFSCSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P2		(1 << 2)
/** PIOB_IFSCSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P1		(1 << 1)
/** PIOB_IFSCSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFSCSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOB_SCDR_DIV_SHIFT		0
#define PIOB_SCDR_DIV_MASK		0x3fff
/** @defgroup piob_scdr_div DIV 
@{*/
/**@}*/


/**@}*/

/** @defgroup piob_ppddr PPDDR Pad Pull-down Disable Register
@{*/

